CSI API ETABS v1
cLineElm.GetLoadDistributed Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoadDistributed(
	string Name,
	ref int NumberItems,
	ref string[] LineName,
	ref string[] LoadPat,
	ref int[] MyType,
	ref string[] CSys,
	ref int[] Dir,
	ref double[] RD1,
	ref double[] RD2,
	ref double[] Dist1,
	ref double[] Dist2,
	ref double[] Val1,
	ref double[] Val2,
	eItemTypeElm ItemTypeElm = eItemTypeElm.Element
)
Function GetLoadDistributed (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef LineName As String(),
	ByRef LoadPat As String(),
	ByRef MyType As Integer(),
	ByRef CSys As String(),
	ByRef Dir As Integer(),
	ByRef RD1 As Double(),
	ByRef RD2 As Double(),
	ByRef Dist1 As Double(),
	ByRef Dist2 As Double(),
	ByRef Val1 As Double(),
	ByRef Val2 As Double(),
	Optional ItemTypeElm As eItemTypeElm = eItemTypeElm.Element
) As Integer
Dim instance As cLineElm
Dim Name As String
Dim NumberItems As Integer
Dim LineName As String()
Dim LoadPat As String()
Dim MyType As Integer()
Dim CSys As String()
Dim Dir As Integer()
Dim RD1 As Double()
Dim RD2 As Double()
Dim Dist1 As Double()
Dim Dist2 As Double()
Dim Val1 As Double()
Dim Val2 As Double()
Dim ItemTypeElm As eItemTypeElm
Dim returnValue As Integer
returnValue = instance.GetLoadDistributed(Name,
	NumberItems, LineName, LoadPat, MyType,
	CSys, Dir, RD1, RD2, Dist1, Dist2, Val1,
	Val2, ItemTypeElm)
int GetLoadDistributed(
	String^ Name,
	int% NumberItems,
	array<String^>^% LineName,
	array<String^>^% LoadPat,
	array<int>^% MyType,
	array<String^>^% CSys,
	array<int>^% Dir,
	array<double>^% RD1,
	array<double>^% RD2,
	array<double>^% Dist1,
	array<double>^% Dist2,
	array<double>^% Val1,
	array<double>^% Val2,
	eItemTypeElm ItemTypeElm = eItemTypeElm::Element
)
abstract GetLoadDistributed :
        Name : string *
        NumberItems : int byref *
        LineName : string[] byref *
        LoadPat : string[] byref *
        MyType : int[] byref *
        CSys : string[] byref *
        Dir : int[] byref *
        RD1 : float[] byref *
        RD2 : float[] byref *
        Dist1 : float[] byref *
        Dist2 : float[] byref *
        Val1 : float[] byref *
        Val2 : float[] byref *
        ?ItemTypeElm : eItemTypeElm
(* Defaults:
        let _ItemTypeElm = defaultArg ItemTypeElm eItemTypeElm.Element
*)
-> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
LineName
Type: System.String[]
LoadPat
Type: System.String[]
MyType
Type: System.Int32[]
CSys
Type: System.String[]
Dir
Type: System.Int32[]
RD1
Type: System.Double[]
RD2
Type: System.Double[]
Dist1
Type: System.Double[]
Dist2
Type: System.Double[]
Val1
Type: System.Double[]
Val2
Type: System.Double[]
ItemTypeElm (Optional)
Type: ETABSv1.eItemTypeElm
Return Value
Type: Int32
See Also
Reference
cLineElm Interface
ETABSv1 Namespace